espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/mipi_dsi_host_struct.h
/** Type of int_st1 register
 *  NA
 */
typedef union {
    struct {
        /** to_hs_tx : RO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t to_hs_tx:1;
        /** to_lp_rx : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t to_lp_rx:1;
        /** ecc_single_err : RO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ecc_single_err:1;
        /** ecc_milti_err : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ecc_milti_err:1;
        /** crc_err : RO; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t crc_err:1;
        /** pkt_size_err : RO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t pkt_size_err:1;
        /** eopt_err : RO; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t eopt_err:1;
        /** dpi_pld_wr_err : RO; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t dpi_pld_wr_err:1;
        /** gen_cmd_wr_err : RO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t gen_cmd_wr_err:1;
        /** gen_pld_wr_err : RO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t gen_pld_wr_err:1;
        /** gen_pld_send_err : RO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t gen_pld_send_err:1;
        /** gen_pld_rd_err : RO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t gen_pld_rd_err:1;
        /** gen_pld_recev_err : RO; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t gen_pld_recev_err:1;
        uint32_t reserved_13:6;
        /** dpi_buff_pld_under : RO; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t dpi_buff_pld_under:1;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} dsi_host_int_st1_reg_t;

/** Type of int_msk0 register
 *  NA
 */
typedef union {
    struct {
        /** mask_ack_with_err_0 : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_0:1;
        /** mask_ack_with_err_1 : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_1:1;
        /** mask_ack_with_err_2 : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_2:1;
        /** mask_ack_with_err_3 : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_3:1;
        /** mask_ack_with_err_4 : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_4:1;
        /** mask_ack_with_err_5 : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_5:1;
        /** mask_ack_with_err_6 : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_6:1;
        /** mask_ack_with_err_7 : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_7:1;
        /** mask_ack_with_err_8 : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_8:1;
        /** mask_ack_with_err_9 : R/W; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_9:1;
        /** mask_ack_with_err_10 : R/W; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_10:1;
        /** mask_ack_with_err_11 : R/W; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_11:1;
        /** mask_ack_with_err_12 : R/W; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_12:1;
        /** mask_ack_with_err_13 : R/W; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_13:1;
        /** mask_ack_with_err_14 : R/W; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_14:1;
        /** mask_ack_with_err_15 : R/W; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t mask_ack_with_err_15:1;
        /** mask_dphy_errors_0 : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t mask_dphy_errors_0:1;
        /** mask_dphy_errors_1 : R/W; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t mask_dphy_errors_1:1;
        /** mask_dphy_errors_2 : R/W; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t mask_dphy_errors_2:1;
        /** mask_dphy_errors_3 : R/W; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t mask_dphy_errors_3:1;
        /** mask_dphy_errors_4 : R/W; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t mask_dphy_errors_4:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} dsi_host_int_msk0_reg_t;

/** Type of int_msk1 register
 *  NA
 */
typedef union {
    struct {
        /** mask_to_hs_tx : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t mask_to_hs_tx:1;
        /** mask_to_lp_rx : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t mask_to_lp_rx:1;
        /** mask_ecc_single_err : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t mask_ecc_single_err:1;
        /** mask_ecc_milti_err : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t mask_ecc_milti_err:1;
        /** mask_crc_err : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t mask_crc_err:1;
        /** mask_pkt_size_err : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t mask_pkt_size_err:1;
        /** mask_eopt_err : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t mask_eopt_err:1;
        /** mask_dpi_pld_wr_err : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t mask_dpi_pld_wr_err:1;
        /** mask_gen_cmd_wr_err : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t mask_gen_cmd_wr_err:1;
        /** mask_gen_pld_wr_err : R/W; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t mask_gen_pld_wr_err:1;
        /** mask_gen_pld_send_err : R/W; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t mask_gen_pld_send_err:1;
        /** mask_gen_pld_rd_err : R/W; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t mask_gen_pld_rd_err:1;
        /** mask_gen_pld_recev_err : R/W; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t mask_gen_pld_recev_err:1;
        uint32_t reserved_13:6;
        /** mask_dpi_buff_pld_under : R/W; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t mask_dpi_buff_pld_under:1;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} dsi_host_int_msk1_reg_t;

/** Type of int_force0 register
 *  NA
 */
typedef union {
    struct {
        /** force_ack_with_err_0 : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_0:1;
        /** force_ack_with_err_1 : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_1:1;
        /** force_ack_with_err_2 : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_2:1;
        /** force_ack_with_err_3 : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_3:1;
        /** force_ack_with_err_4 : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_4:1;
        /** force_ack_with_err_5 : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_5:1;
        /** force_ack_with_err_6 : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_6:1;
        /** force_ack_with_err_7 : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_7:1;
        /** force_ack_with_err_8 : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_8:1;
        /** force_ack_with_err_9 : R/W; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_9:1;
        /** force_ack_with_err_10 : R/W; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_10:1;
        /** force_ack_with_err_11 : R/W; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_11:1;
        /** force_ack_with_err_12 : R/W; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_12:1;
        /** force_ack_with_err_13 : R/W; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_13:1;
        /** force_ack_with_err_14 : R/W; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_14:1;
        /** force_ack_with_err_15 : R/W; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t force_ack_with_err_15:1;
        /** force_dphy_errors_0 : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t force_dphy_errors_0:1;
        /** force_dphy_errors_1 : R/W; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t force_dphy_errors_1:1;
        /** force_dphy_errors_2 : R/W; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t force_dphy_errors_2:1;
        /** force_dphy_errors_3 : R/W; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t force_dphy_errors_3:1;
        /** force_dphy_errors_4 : R/W; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t force_dphy_errors_4:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} dsi_host_int_force0_reg_t;

/** Type of int_force1 register
 *  NA
 */
typedef union {
    struct {
        /** force_to_hs_tx : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t force_to_hs_tx:1;
        /** force_to_lp_rx : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t force_to_lp_rx:1;
        /** force_ecc_single_err : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t force_ecc_single_err:1;
        /** force_ecc_milti_err : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t force_ecc_milti_err:1;
        /** force_crc_err : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t force_crc_err:1;
        /** force_pkt_size_err : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t force_pkt_size_err:1;
        /** force_eopt_err : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t force_eopt_err:1;
        /** force_dpi_pld_wr_err : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t force_dpi_pld_wr_err:1;
        /** force_gen_cmd_wr_err : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t force_gen_cmd_wr_err:1;
        /** force_gen_pld_wr_err : R/W; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t force_gen_pld_wr_err:1;
        /** force_gen_pld_send_err : R/W; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t force_gen_pld_send_err:1;
        /** force_gen_pld_rd_err : R/W; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t force_gen_pld_rd_err:1;
        /** force_gen_pld_recev_err : R/W; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t force_gen_pld_recev_err:1;
        uint32_t reserved_13:6;
        /** force_dpi_buff_pld_under : R/W; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t force_dpi_buff_pld_under:1;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} dsi_host_int_force1_reg_t;


typedef struct dsi_host_dev_t {
    volatile dsi_host_version_reg_t version;
    volatile dsi_host_pwr_up_reg_t pwr_up;
    volatile dsi_host_clkmgr_cfg_reg_t clkmgr_cfg;
    volatile dsi_host_dpi_vcid_reg_t dpi_vcid;
    volatile dsi_host_dpi_color_coding_reg_t dpi_color_coding;
    volatile dsi_host_dpi_cfg_pol_reg_t dpi_cfg_pol;
    volatile dsi_host_dpi_lp_cmd_tim_reg_t dpi_lp_cmd_tim;
    volatile dsi_host_dbi_vcid_reg_t dbi_vcid;
    volatile dsi_host_dbi_cfg_reg_t dbi_cfg;
    volatile dsi_host_dbi_partitioning_en_reg_t dbi_partitioning_en;
    volatile dsi_host_dbi_cmdsize_reg_t dbi_cmdsize;
    volatile dsi_host_pckhdl_cfg_reg_t pckhdl_cfg;
    volatile dsi_host_gen_vcid_reg_t gen_vcid;
    volatile dsi_host_mode_cfg_reg_t mode_cfg;
    volatile dsi_host_vid_mode_cfg_reg_t vid_mode_cfg;
    volatile dsi_host_vid_pkt_size_reg_t vid_pkt_size;
    volatile dsi_host_vid_num_chunks_reg_t vid_num_chunks;
    volatile dsi_host_vid_null_size_reg_t vid_null_size;
    volatile dsi_host_vid_hsa_time_reg_t vid_hsa_time;
    volatile dsi_host_vid_hbp_time_reg_t vid_hbp_time;
    volatile dsi_host_vid_hline_time_reg_t vid_hline_time;
    volatile dsi_host_vid_vsa_lines_reg_t vid_vsa_lines;
    volatile dsi_host_vid_vbp_lines_reg_t vid_vbp_lines;
    volatile dsi_host_vid_vfp_lines_reg_t vid_vfp_lines;
    volatile dsi_host_vid_vactive_lines_reg_t vid_vactive_lines;
    volatile dsi_host_edpi_cmd_size_reg_t edpi_cmd_size;
    volatile dsi_host_cmd_mode_cfg_reg_t cmd_mode_cfg;
    volatile dsi_host_gen_hdr_reg_t gen_hdr;
    volatile dsi_host_gen_pld_data_reg_t gen_pld_data;
    volatile dsi_host_cmd_pkt_status_reg_t cmd_pkt_status;
    volatile dsi_host_to_cnt_cfg_reg_t to_cnt_cfg;
    volatile dsi_host_hs_rd_to_cnt_reg_t hs_rd_timeout_cnt;
    volatile dsi_host_lp_rd_to_cnt_reg_t lp_rd_timeout_cnt;
    volatile dsi_host_hs_wr_to_cnt_reg_t hs_wr_timeout_cnt;
    volatile dsi_host_lp_wr_to_cnt_reg_t lp_wr_timeout_cnt;
    volatile dsi_host_bta_to_cnt_reg_t bta_timeout_cnt;
    volatile dsi_host_sdf_3d_reg_t sdf_3d;
    volatile dsi_host_lpclk_ctrl_reg_t lpclk_ctrl;
    volatile dsi_host_phy_tmr_lpclk_cfg_reg_t phy_tmr_lpclk_cfg;
    volatile dsi_host_phy_tmr_cfg_reg_t phy_tmr_cfg;
    volatile dsi_host_phy_rstz_reg_t phy_rstz;
    volatile dsi_host_phy_if_cfg_reg_t phy_if_cfg;
    volatile dsi_host_phy_ulps_ctrl_reg_t phy_ulps_ctrl;
    volatile dsi_host_phy_tx_triggers_reg_t phy_tx_triggers;
    volatile dsi_host_phy_status_reg_t phy_status;
    volatile dsi_host_phy_tst_ctrl0_reg_t phy_tst_ctrl0;
    volatile dsi_host_phy_tst_ctrl1_reg_t phy_tst_ctrl1;
    volatile dsi_host_int_st0_reg_t int_st0;
    volatile dsi_host_int_st1_reg_t int_st1;
    volatile dsi_host_int_msk0_reg_t int_msk0;
    volatile dsi_host_int_msk1_reg_t int_msk1;
    volatile dsi_host_phy_cal_reg_t phy_cal;
    uint32_t reserved_0d0[2];
    volatile dsi_host_int_force0_reg_t int_force0;
    volatile dsi_host_int_force1_reg_t int_force1;
    uint32_t reserved_0e0[4];
    volatile dsi_host_dsc_parameter_reg_t dsc_parameter;
    volatile dsi_host_phy_tmr_rd_cfg_reg_t phy_tmr_rd_cfg;
    uint32_t reserved_0f8[2];
    volatile dsi_host_vid_shadow_ctrl_reg_t vid_shadow_ctrl;
    uint32_t reserved_104[2];
    volatile dsi_host_dpi_vcid_act_reg_t dpi_vcid_act;
    volatile dsi_host_dpi_color_coding_act_reg_t dpi_color_coding_act;
    uint32_t reserved_114;
    volatile dsi_host_dpi_lp_cmd_tim_act_reg_t dpi_lp_cmd_tim_act;
    volatile dsi_host_edpi_te_hw_cfg_reg_t edpi_te_hw_cfg;
    uint32_t reserved_120[6];
    volatile dsi_host_vid_mode_cfg_act_reg_t vid_mode_cfg_act;
    volatile dsi_host_vid_pkt_size_act_reg_t vid_pkt_size_act;
    volatile dsi_host_vid_num_chunks_act_reg_t vid_num_chunks_act;
    volatile dsi_host_vid_null_size_act_reg_t vid_null_size_act;
    volatile dsi_host_vid_hsa_time_act_reg_t vid_hsa_time_act;
    volatile dsi_host_vid_hbp_time_act_reg_t vid_hbp_time_act;
    volatile dsi_host_vid_hline_time_act_reg_t vid_hline_time_act;
    volatile dsi_host_vid_vsa_lines_act_reg_t vid_vsa_lines_act;
    volatile dsi_host_vid_vbp_lines_act_reg_t vid_vbp_lines_act;
    volatile dsi_host_vid_vfp_lines_act_reg_t vid_vfp_lines_act;
    volatile dsi_host_vid_vactive_lines_act_reg_t vid_vactive_lines_act;
    uint32_t reserved_164;
    volatile dsi_host_vid_pkt_status_reg_t vid_pkt_status;
    uint32_t reserved_16c[9];
    volatile dsi_host_sdf_3d_act_reg_t sdf_3d_act;
} dsi_host_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(dsi_host_dev_t) == 0x194, "Invalid size of dsi_host_dev_t structure");
#endif

extern dsi_host_dev_t MIPI_DSI_HOST;

#ifdef __cplusplus
}
#endif
